# Ամենաերկար ընդհանուր ենթահաջորդականությունը
# 1143. Longest Common Subsequence - LeetCode
# Տրված է n երկարություն ունեցող str1 և m երկարություն ունեցող srt2 հաջորդականությունները։
# Պահանջվում է գտնել str1 և str2 հաջորդականությունների ամենաերկար ընդհանուր ենթահաջորդականությունը։
# Օրինակ՝
# Մուտք str1 = "abcde", str2 = "ace"
# Ելք LCS = “ace” (երկարությունը՝ 3)
# 1. Քննարկել խնդրի brute force լուծումը:
# 2. Սահմանել lcs(i, j) ֆունկցիան։
# 3. Լուծել ռեկուրսիվ, գտնելով միայն ամենաերկար ընդհանուր ենթահաջորդականության երկարությունը։
# 4. Ներկայացնել կանչերի ծառը օրինակի համար։
# 5. Կիրառել DP տեխնիկան, կրկնակի կանչերից խուսափել համար։ Իրականացնել top-down (memoizaon) և boom-up (tabulaon) մեթոդներով։
# 6. Ձևափոխել ֆունկցիան այնպես, որ արդյունքում ստանանք ամենաերկար պալինդրոմ ենթահաջորդականությունը։
# 7. Իրականացնել lcs(str1, str2, str3) ֆունկցիան։

