# 2. (40 միավոր) Տրված է n երկարություն ունեցող թվերի X = [x1, x2, ... xn] հաջորդականությունը։
# X-ի S = [xi1, xi2, ... xik] (որտեղ 1 ≤ i1 < i2 < ... < i1 < ik ≤ n) ենթահաջորդականությունը կոչվում է բիտոն,
# եթե ∃j ∈ 1, k,  xi1 < xi2 < ... < xij եւ xij > xi(j+1) > ... > xik:
# Պահանջվում է գտնել X հաջորդականության ամենաերկար բիտոն ենթահաջորդականության երկարությունը`
# L = max|S|, S ⊆ X, որտեղ S-ը աճող է։
# Օրինակ՝
# Մուտք X = [1, 2, 1, 3, 1, 4, 4, 1, 3, 1, 2, 1]
# Ելք 7, (LIS = [1, 2, 3, 4, 3, 2, 1])
